; domain
;; Source: https://github.com/josej30/Planner-Sat-Constraints

(define (domain logistics)

(:requirements :strips :typing) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location ?c - city)
         :precondition  (and (at ?t ?from)
                             (in-city ?from ?c)
                             (in-city ?to ?c))
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_logistics_1)

(:domain logistics)

(:objects
	obj0 obj3 obj6 obj9 - airport
	obj1 obj4 - city
	obj2 obj5 obj7 obj10 - truck
	obj8 - airplane
	obj11 obj12 obj13 obj14 obj15 obj16 - package
)

(:init
	(in-city obj0 obj1)
	(in-city obj3 obj4)
	(at obj14 obj9)
	(at obj2 obj0)
	(at obj7 obj6)
	(at obj10 obj9)
	(at obj12 obj3)
	(at obj16 obj9)
	(at obj5 obj3)
	(at obj11 obj9)
	(at obj15 obj3)
	(in-city obj9 obj1)
	(in-city obj6 obj1)
	(at obj13 obj6)
	(at obj8 obj0)
)

(:goal (and
	(at obj16 obj3)
	(at obj15 obj9)
	(at obj13 obj3)
	(at obj14 obj6)
	(at obj12 obj0)
	(at obj11 obj0)
))
)

; plan
1. (fly obj8 obj0 obj9)
   deleted: (at obj8 obj0)
   added: (at obj8 obj9)
   goals met: 0 of 6
2. (load obj8 obj16 obj9)
   deleted: (at obj16 obj9)
   added: (in obj16 obj8)
   goals met: 0 of 6
3. (load obj8 obj14 obj9)
   deleted: (at obj14 obj9)
   added: (in obj14 obj8)
   goals met: 0 of 6
4. (fly obj8 obj9 obj3)
   deleted: (at obj8 obj9)
   added: (at obj8 obj3)
   goals met: 0 of 6
5. (unload obj8 obj16 obj3)
   deleted: (in obj16 obj8)
   added: (at obj16 obj3)
   goals met: 1 of 6
6. (load obj8 obj15 obj3)
   deleted: (at obj15 obj3)
   added: (in obj15 obj8)
   goals met: 1 of 6
7. (load obj8 obj12 obj3)
   deleted: (at obj12 obj3)
   added: (in obj12 obj8)
   goals met: 1 of 6
8. (fly obj8 obj3 obj9)
   deleted: (at obj8 obj3)
   added: (at obj8 obj9)
   goals met: 1 of 6
9. (unload obj8 obj15 obj9)
   deleted: (in obj15 obj8)
   added: (at obj15 obj9)
   goals met: 2 of 6
10. (load obj8 obj11 obj9)
   deleted: (at obj11 obj9)
   added: (in obj11 obj8)
   goals met: 2 of 6
11. (fly obj8 obj9 obj0)
   deleted: (at obj8 obj9)
   added: (at obj8 obj0)
   goals met: 2 of 6
12. (unload obj8 obj12 obj0)
   deleted: (in obj12 obj8)
   added: (at obj12 obj0)
   goals met: 3 of 6
13. (unload obj8 obj11 obj0)
   deleted: (in obj11 obj8)
   added: (at obj11 obj0)
   goals met: 4 of 6
14. (fly obj8 obj0 obj3)
   deleted: (at obj8 obj0)
   added: (at obj8 obj3)
   goals met: 4 of 6
15. (fly obj8 obj3 obj6)
   deleted: (at obj8 obj3)
   added: (at obj8 obj6)
   goals met: 4 of 6
16. (unload obj8 obj14 obj6)
   deleted: (in obj14 obj8)
   added: (at obj14 obj6)
   goals met: 5 of 6
17. (load obj8 obj13 obj6)
   deleted: (at obj13 obj6)
   added: (in obj13 obj8)
   goals met: 5 of 6
18. (fly obj8 obj6 obj3)
   deleted: (at obj8 obj6)
   added: (at obj8 obj3)
   goals met: 5 of 6
19. (unload obj8 obj13 obj3)
   deleted: (in obj13 obj8)
   added: (at obj13 obj3)
   goals met: 6 of 6
